routes/api.php

delete from `users` where `id` = '7'
delete from `users` where `id` = '1'
---
    DB::table('product')->where('id', '=', $id)->delete();
    // return redirect('/khachhang');
});
Route::delete('delete/user/{id}', function ($id) {
    DB::table('users')->where('id', '=', $id)->delete();
    // return redirect('/khachhang');
});

update `product` set `CategoryID` = 4, `price` = '150000', `name` = 'Chân váy111', `description` = 'Tủ đồ thời trang của nàng sẽ chưa thể hoàn thiện nếu thiếu những món đồ cơ bản như áo sweater, áo khoác, quần jeans, và đặc biệt là một chiếc váy Daisy Skirt.\r\n\r\nChân váy dáng mini, phom chữ A với phần bèo nhún ở gấu váy tạo điểm nhấn nhá đầy nữ tính và không kém phần điệu đà. Thêm vào đó, họa tiết hoa càng khiến mẫu váy thêm phần xinh xắn, đáng yêu khiến các nàng không thể chối từ.', `image` = 'upload\file5dfa3db645ee77.15163243.PNG', `updated_at` = '2019-12-18 14:54:46' where `id` = '89'
update `product` set `CategoryID` = 4, `price` = '150000', `name` = 'Chân váy111', `description` = 'Tủ đồ thời trang của nàng sẽ chưa thể hoàn thiện nếu thiếu những món đồ cơ bản như áo sweater, áo khoác, quần jeans, và đặc biệt là một chiếc váy Daisy Skirt.\r\n\r\nChân váy dáng mini, phom chữ A với phần bèo nhún ở gấu váy tạo điểm nhấn nhá đầy nữ tính và không kém phần điệu đà. Thêm vào đó, họa tiết hoa càng khiến mẫu váy thêm phần xinh xắn, đáng yêu khiến các nàng không thể chối từ.', `updated_at` = '2019-12-18 14:51:51' where `id` = '89'
---
        info('vao if');
        $imageUpdate = $request->file('image2');
        $newImageURLUpdate = UploadFile::uploadFile('upload', $imageUpdate);
        DB::table('product')
            ->where('id', $id)
            ->update([
                'CategoryID'=>$cate,
                'price'=>$gia,
                'name'=>$name,
                'description'=>$mota,
                'image'=>$newImageURLUpdate,
                'updated_at' => now(),
            ]);
    }
    else {
        info('vao else');
        DB::table('product')->where('id',$id)
                        ->update($data);

select `product`.*, `category`.`CategoryName`, `category`.`id` from `product` inner join `category` on `category`.`id` = `product`.`CategoryID` where `product`.`id` = '1'
select `brithdate` from `users` limit 1
select * from `users` where `users`.`id` = '2'
select `brithdate` from `users`
---
    return redirect('/sanpham');

});
Route::post('admin/viewdetail',function(Request $request){
    $id=$request->id;
    $product=DB::table('product')->where('product.id',$id)
                                ->join('category','category.id','=','product.CategoryID')
                                ->select('product.*','category.CategoryName','category.id')
                                ->get();
    // $category=DB::table('category')->get();
    // info($category);
    return $product;

});
Route::post('admin/viewdetailUser',function(Request $request){
    $id=$request->id;
    $product=DB::table('users')->where('users.id',$id)
                                ->get();
    $test=DB::table('users')->select('brithdate')->get();
    info($test);
    // info($category);
    return $product;

});

insert into `users` (`name`, `email`, `password`, `brithdate`, `isAdmin`, `created_at`, `updated_at`) values ('minhduc2', 'voduchau0101111997@gmail.com', 'y$zkvT1WxzAhBPHJQGOSdYpuwBcL.BveXOYDPKjI8ul5ad4zbH7/.ni', '2011-08-19', '0', '2019-12-19 11:50:22', '2019-12-19 11:50:22')
insert into `users` (`name`, `email`, `password`, `brithdate`, `isAdmin`, `created_at`, `updated_at`) values ('minhduc123', 'voduchau01111011997@gmail.com', 'y$nUiywAoD8MPVSWJB/LNxdOY0q6tHQ2ZmbHpDlEyrx0OON8DKfKLkG', '2011-08-10', '0', '2019-12-19 12:10:54', '2019-12-19 12:10:54')
---

    return redirect('/khachhang');
});
Route::post('/themuser',function(Request $request){
    $username=$request->input('username');
    $email=$request->input('email');
    $password=bcrypt($request->input('password'));
    $date=$request->input('date');
    $role=$request->get('role');
    DB::table('users')->insert(
        [
            'name'=>$username,
            'email'=>$email,
            'password'=>$password,
            'brithdate'=>$date,
            'isAdmin'=>$role,
            'created_at'=>now(),
            'updated_at'=>now(),
        ]
    );
    return redirect('/user');
});