routes/web.php

select `product`.*, `category`.`CategoryName` from `product` inner join `category` on `product`.`CategoryID` = `category`.`id`
---
});

Route::get('/sanpham', function () {
    $data = DB::table('product')
        ->join('category', 'product.CategoryID', '=', 'category.id')
        ->select('product.*', 'category.CategoryName')
        ->get();

select * from `Category`
---
});

route::get('/themsp', function () {
    $data = DB::table('Category')->get();

select * from `users`
---
    return view('themsp', ['data' => $data]);
});
route::get('/themuser', function () {
    $data = DB::table('users')->get();

select * from `product` where `id` = '97'
select * from `product` where `id` = '1'
select * from `users`
select * from `users` where `id` = '1'
---
});


Route::get('/xemthem/{id}', function ($id) {
    $data = DB::table('product')->where('id', '=', $id)->get();
    // dd($data);
    return view('xemthem', ['data' => $data]);
});
Route::get('/xemthemUser/{id}', function ($id) {
    $data = DB::table('users')->where('id', '=', $id)->get();
    // dd($data);
    return view('xemthemUser', ['data' => $data]);
});
Route::get('/user',function(){
    $users = DB::table('users')->get();